{
    "events": [
        {
            "name": "softablitz",
            "displayName": "Softablitz",
            "info": "Has a software ever made you go insane? Has a software ever fascinated you so much that you fall for it like your beloved? If the above questions have triggered a bulb in your neurons, then you've landed in the right place!! To all the software geeks out there, here's your chance to gear up your enthusiasm and consume your grey matter in developing some fascinating software. Let the \"blitz\" of developing software make you go wild and let IntelliJ IDEA be your life for this Avishkar. Together let's make Softablitz big."
        },
        {
            "name": "insomnia",
            "displayName": "Insomnia",
            "info": "Are you one of those who love brainstorming and problem-solving? Are you one who feels like coding is fun? Are you the one who loves algorithms and data structures? If you find yourself in this league, then this contest is just for you.Insomnia is the flagship competitive coding event of annual technical fest Avishkar of MNNIT, Allahabad. It is an ACM-ICPC style team programming contest. Participants from all over the world can register and no registration fee is required. The team can consist up to maximum 3 members. The event consists of 2 rounds. The first round is an online qualifying round of 3 hrs. and the shortlisted teams will battle in the second round which is an onsite final round of 5 hrs. The problem set in each round promises to be interesting and of varying difficulty level.So, don’t miss the chance of being in an “insomniac” atmosphere of coders. Insomnia gives you a chance to showcase your coding skills in a rigorous and challenging contest and to win exciting prizes."
        },
        {
            "name": "softathalon",
            "displayName": "Softathalon",
            "info": "Softathlon is the annual flagship event of MNNIT Allahabad. This is the placement oriented event to put your knowledge to test in different topics related to computer science. It tests you by hosting programming and logical round, group discussion and personal interviews. Come and get insight on how the placements sessions work.“Let the knowledge do the talking.“"
        },
        {
            "name": "webster",
            "displayName": "Webster",
            "info": "The web is one of the greatest inventions. Whether it's watching your favorite shows, booking tickets, sharing pictures the web has covered you. Webster is a platform for aspiring web developers to showcase their skills. The registered teams will be given some problem statements on what to build. The event consists of 3 rounds, abstract submission, and onsite coding and final submission. Three winning teams will be chosen based on their performances. Come let's build the web for all."
        },
        {
            "name": "droidrush",
            "displayName": "Droidrush",
            "info": "Android is intended to be customizable, and we welcome innovations. Starting from smartphones, tablets to TVs and wearable’s, Android is one of the most used OS worldwide. Over 1.5 billion people use it regularly. Droidrush is annual android app development event of MNNIT Allahabad. The event helps you grasp in the concepts of android development and provides you with a pool of opportunities. You can also get a chance to publish your application on Play Store itself. “Come, Show your ideas and develop the next revolutionizing app”"
        },
        {
            "name": "codeoftheday",
            "displayName": "Code of the Day",
            "info": "“A code a day keeps boredom away” Ever felt like you can do the problem but want more time to solve, then Code of the Day (COD) is for you. COD is 7 days long programming contest intended for enthusiast programmer which will help them evolve/build their logical thinking. Every day new question will release in increasing level of difficulty, one need to submit the correct solution within 24 hours to get the full score. With each passing day, maximum score for correct submission will decrease linearly."
        },
        {
            "name": "operaomnia",
            "displayName": "Operaomnia",
            "info": "An event where your mind will think faster than before. An event where your IQ will be challenged to yet another level, An event where your zeal for mind twisters will be raised to a new high, An event where your brain, with riddles is surely gonna fly. An event where the puzzles will puzzle your mind and heart, as never before.  Behold yourself, as Avishkar presents to you, Operomnia, an event where your mind goes on an adventurous ride with the puzzles and riddles and which will instigate an adrenaline rush in all those puzzle loving minds.Come and see what puzzles can do to you and you to puzzles. "
        },
        {
            "name": "revengg",
            "displayName": "Revengg",
            "info": "“Basically, if reverse engineering is banned, then a lot of open source community is doomed to fail.” ...and today we literally live in the era of open-source. No wonders that with every byte of information we add to our cellphone or laptop, the complicated and never-ending mesh of computers all over the world are affected by us. It is the reverse engineering that the hackers use to pull out the sensitive information from our data and have an inevitable serious impact on us. REVENGG is the event, short for REVerse ENGineering that takes out the playful hacker from inside of the young talents. With a series of events, rounds and games, the participants are tried to be given a hand-on experience of the intricacies of a computer. There shall be “Capture the Flag” events, to expose the real-world hacking and information retrieval to the participants. The winners will be awarded with cool prizes and goodies. And who knows when the next world war will be a Cyber War, you will be on the winning side!"
        },
        {
            "name": "tuxwars",
            "displayName": "Tuxwars",
            "info": "The Linux philosophy is ‘Laugh in the face of danger’. Oops. Wrong One. ‘Do it yourself’. Yes, that’s it.” - Linus Torvalds. Linux is the most fascinating operating system and the true-love of all the programmers. Linux is free, secure, flexible, customizable and most widely deployed operating system in the world. Many of the devices we own, let alone Android, digital storage, video recorders, cameras, smart watches and what not run the Linux kernel in their core. That makes everyone, from even a novice or an expert programmer, feel the need to learn about Linux. TUXWARS is the event for all such curious souls out there to learn, apply and play with Linux perks and delve deeper into its bits and bytes. The event focuses on the core concepts and wide variety of applications and perks that the secure Linux kernel provides us. There shall be various rounds for testing and evaluating the performance of the participants, with cool prizes waiting for the winners alongside.After all, ‘Do it yourself’ is the Linux philosophy."
        },
        {
            "name": "opensource",
            "displayName": "OpenSource",
            "info": "An Open Source Event, which aims to get more people into the world of open source. This event gives a jumpstart to open source development skills. It also serves as a warm up for GSoC and other global open source competitions. This is a month long event, throughout the whole event participants learn different open source tools, solve various issues and compete against one another to be the winner."
        },
        {
            "name": "sphinx",
            "displayName": "Sphinx",
            "info": "\"Well, if it can be thought, it can be done, a problem can be overcome\".Avishkar brings to you a mind-altering enigmatic extravaganza where quick-wit will be your guide, speed will be your weapon, math will be your language and your mind will be blown! Get ready to unleash the genius within you and let's see who wins this battle of logic and speed."
        },
        {
            "name": "codeoftheday",
            "displayName": "Code of the Day",
            "info": "“A code a day keeps boredom away” Ever felt like you can do the problem but want more time to solve, then Code of the Day (COD) is for you. COD is 7 days long programming contest intended for enthusiast programmer which will help them evolve/build their logical thinking. Every day new question will release in increasing level of difficulty, one need to submit the correct solution within 24 hours to get the full score. With each passing day, maximum score for correct submission will decrease linearly."
        },
        {
            "name": "logicalrhythm",
            "displayName": "Logical Rhythm",
            "info": "Logical Rhythm, the flagship #AI event of Avishkar, techno-management festival of MNNIT; where, #ML enthusiasts pitch their data skills against themselves to come up with better solutions for classic #ML problems in the industry. The event also serves to induct the fresher’s into the world of #ML and #DL, and give them a firsthand experience of AI development.It has been long hailed that Machine Learning is the electricity of 21st century, but, the reality is, Machine Learning applications are still in their infancy. To harness its full potential and have it diffuse into the masses, like electricity, more minds are needed to be put into its development, which has also been the conclusion of many tech giants in the field.Conceived with the aim to bring AI within the reach of more developers, and AI developers to industry to solve its long standing problems; the event opens its competition platform across colleges, years and streams, witnessing participations from all over India*."
        },
        {
            "name": "inception",
            "displayName": "Inception",
            "info": "An event for budding coders/developers (fresher’s) which will introduce them to the world of programming. We intend to induce reasoning and problem solving skills in them with a blend of technical know-how which will help them in taking the first step in the journey of development."
        },
        {
            "name": "codewarriors",
            "displayName": "Code Warriors",
            "info": "CodeWarrior is CyberQuest flagship Artificial Intelligence Challenge. It's one of a kind challenge that will run for 21 days (Tentative). There is only one problem statement in the challenge - the game for which you have to write a bot.You will be given a two-player game and you have to write a bot that will play that game against other bots. Your bot has to adhere to the rules of the game given in the problem statement, and play against the other bot.While the challenge is live, you will have one system generated bot against which you can test your bot. The default bot will be a very basic bot, if you win against that bot it doesn't mean you will win against other players also.Also you can challenge other people who have submitted their bots to play against you. Once the challenge is over, all the bots that have been submitted will be played against other bots in a onsite tournament. The bot that wins the tournament will be declared the winner."
        }
    ]
}