{
    "events": [
        {
            "name": "quintathloncore",
            "displayName": "Quintathlon (core)",
            "info": "An event to accustom an electronics engineer with the company recruitment process and to relinquish the pressure before going through the recruitment process.This will make your mental ability,technical as well as software skills in execution at its best.Commencing with the online test round (technical aptitude and software)followed by interview rounds comprising of software,technical,hr and finally the group discussions.GDs will give you a platform to open up and will test your current affairs knowledge.The online test round will have a cut off and the selected ones move to next round.After this there is no elimination round as such .All candidates get to sit in interviews and GD.The scorecard will be prepared by summing up the marks achieved in every round.And the witty one to get maximum marks will be announced as the winner."
        },
        {
            "name": "circuitoftheday",
            "displayName": "Circuit of the day",
            "info": "It is 1 week event, in which 1 circuit solving problem is provided daily and 24 hours time limit is given for solving each circuit.Circuit will be solved using Proteus simulation software.Different question set will be generated for 2nd and 3rd year.Marking will depend on time of submission and on complexity of the circuit."
        },
        {
            "name": "quintathlonsoftware",
            "displayName": "Quintathlon (software)",
            "info": "No description provided"
        },
        {
            "name": "codotron",
            "displayName": "Codotron",
            "info": "\"Truth can only be found in one place: the code.\"- Robert C. Martin. Electromania brings you a platform to show off your coding skills. The ACM-ICPC style coding competition will test your coordination, resilience  and on-the-go-jugaad skills. So gear up, put on your thinking caps, form the best team you can, and code to win."
        },
        {
            "name": "embeddeddesign",
            "displayName": "Embedded Design",
            "info": "First the problem and design specifications are given to the participants. Problem statement is based on designing real device using 8 bit micro-controller platform.Microcontroller is programmed using IDE and appropriate hardware circuit is interfaced with it.This event is unique as it challenges participants to work in both domain software as well as in hardware circuit design and it's optimization to reduce the overall project cost."
        },
        {
            "name": "impromptu",
            "displayName": "Impromptu",
            "info": "Impromptu, an on-the-spot circuit designing event, tests the fundamentals of Electronics Engineer, their presence of mind, and ability to come out with innovative designs in limited time with limited resources. This event provides a healthy platform for all electronics enthusiasts to exhibit their skills against the best of the best in this specialization. "
        },
        {
            "name": "operaomnia",
            "displayName": "Operaomnia",
            "info": "An event where your mind will think faster than before. An event where your IQ will be challenged to yet another level, An event where your zeal for mind twisters will be raised to a new high, An event where your brain, with riddles is surely gonna fly. An event where the puzzles will puzzle your mind and heart, as never before.  Behold yourself, as Avishkar presents to you, Operomnia, an event where your mind goes on an adventurous ride with the puzzles and riddles and which will instigate an adrenaline rush in all those puzzle loving minds.Come and see what puzzles can do to you and you to puzzles. "
        },
        {
            "name": "innodev",
            "displayName": "Innodev",
            "info": "Software Development is quintessential part for engineering students' skillset, especially those belonging to the circuit branches. The diverse problems that entail from all the circuit branches, often require a combination of technology paradignss to develop the desired holistic solutions. Innodev aims to provide a platform where developers could develop holistic solutions to the present day problems, using the full spectrum of development tools available to them."
        },
        {
            "name": "combomagic",
            "displayName": "Combo Magic",
            "info": "It is a circuit designing event in which the one who come with a better circuit with less complexity will be winner.This event will enhance the knowledge of reducing circuit complexity and will improve there skills of making circuits.For first year this event will make them familiar with different basic but important components and their uses and they will also learn how to make a combination of different component to make magic and from this comes the name. Giving you one of the event with maximum no of participation....... Combo Magic. P.S.-programmable components are not allowed"
        },
        {
            "name": "fpga",
            "displayName": "FPGA",
            "info": "FPGA (Design), one of the major hardware events in Electromania, is targeted to the designing of FPGA synthesis solutions with industrial applications in the fields like computer architecture, digital signal processing, cryptography, etc. Verilog HDL (Hardware Description Language) is the hardware description language used for synthesis solutions followed by their behavioral simulation and implementation on FPGA kits available for the academic purpose- ranging from the Spartan 3 family to Artix 7 family."
        },
        {
            "name": "robomania",
            "displayName": "Robomania",
            "info": "There will basically be 3 events.\n 1. Line following robot for 1st year \n 2. Autonomous robotics (open to all event) \n 3. Manual robotics \nThe problem statement will be provided to the participants. The solution to the problem statement will be in different levels(from basic to higher levels). There will be partial marking for solving each .The problem statement for designing robot is accomplished using 8 bit microcontroller.Microcontroller is programed using IDE and appropriate hardware circuitry is interfaced with it.The robot will involve interfacing of various electronic components which will provide a deep and practical understanding to the students.This event is unique as it is one of the few hardware events for all the years including first years and it provides a strong base for future endeavours in the field of robotics."
        }
    ]
}