{"success":true,"subEvents":[{"problemStatements":["https://drive.google.com/uc?export=download&id=1Mfx_1Dwh6F3Bi2SyvC3Nzi4lR-GQJH8r"],"_id":"5b92c6c755218e15dff4aabf","name":"palladin","displayName":"Palladin","size":1,"category":"genesis","image":"Palladin.jpg","info":"\"Find out what you like doing best and get someone to pay you for doing it.\" This event will evaluate your Aptitude,communication skills, and confidence needed to fully participate and succeed in the corporate world. Take charge of your career trajectory and unlock your potential to create winning strategies. Finally, this event will include all the processes which are followed during placements.","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1uUq3Bm0L03YqgFvK41eFtcWbweewQ_Ov"],"_id":"5b92c6c755218e15dff4aac0","name":"centraldogma","displayName":"Central Dogma","size":3,"category":"genesis","image":"Central_Dogma.jpg","info":"\"Biotechnology is the third wave in biological science and represents such an interface of basic and applied sciences, where gradual and subtle transformation of science into technology can be witnessed.”“It is beyond expectation on what the biotechnology has accomplished and reached in just a matter of time. Humanity has just start to comprehend and recognized the endless opportunities it has open. As technology assures to provide solution to every frightening problem we face every now and then, so is mankind is expecting a more develop biotechnology in the future. A technology that is more reliable and firm”.“Biotechnology can be a great solution to mankind struggles”.Do you know that in Norway there is a vault for storing seeds in case of Third World War like destruction?Do you know that DNA can be used as data-storage devices?Do you know that there are super-muscled pigs, fast-growing salmon,featherless chicken and see-through frogs?Currently, there is so much going on in the field of biotechnology!We bring you “Central Dogma”, the core event of Genesis, which is highly revered for those inquisitive scientists who wish to achieve breakthrough in biotechnology research.Participate in one of the most challenging event designed for the research-oriented community.\"Research is what I’m doing when I don’t know what I’m doing.\" -Wernher von Braun","__v":0},{"problemStatements":[],"_id":"5b92c6c755218e15dff4aac1","name":"cluequest","displayName":"Cluequest","size":5,"category":"genesis","image":"Cluequest.jpg","info":"\"Extraordinary things are always hiding in places people never think to look\".Do you have what it takes to uncover the hidden truth and to solve mind boggling puzzles? This event will test your determination and your wits as you will have to dig deeper to win. So, freshen up your wits, tie your shoelaces and get ready for the most exhilarating and thrilling part of Genesis and Avishkar.","__v":0}]}