{"success":true,"subEvents":[{"problemStatements":[],"_id":"5b92c6c755218e15dff4aacb","name":"chanakyaneeti","displayName":"Chanakya Neeti","size":2,"category":"monopoly","image":"Chanakya_neeti.jpg","info":"We cannot solve a problem with the same level of thinking that created them. Explore the ratiocinative skills in you. Every situation has numerous solutions; the most efficacious one is required. We learn theory, time to apply some of the skills into reality. Chanakya Neeti will put you into the shoes of a world class manager that will help you to take strategic decisions at a spur of the moment. Like Chanakya this event will give you the chance of making the definitive strategies for business scenarios. GRAB THE OPPORTUNITY!","__v":0},{"problemStatements":[],"_id":"5b92c6c755218e15dff4aacc","name":"netritva","displayName":"Netritva (Monopoly)","size":1,"category":"monopoly","image":"Netritva.png","info":"Too often, we believe our basic skills and credentials suffice, however, personal presence, self- assurance, and grace under pressure—charisma—differentiate the best leaders from others with similar talents and backgrounds. These qualities improve the ability to make a positive first impression as well as a lasting one, connect quickly and authentically with important people and develop an inner sense of confidence. Netritva is one such event which looks out for such charisma in the participants to bring out the true leaders in this leadership event of Avishkar, through multiple exciting and challenging rounds.","__v":0},{"problemStatements":[],"_id":"5b92c6c755218e15dff4aacd","name":"stallmart","displayName":"Stallmart","size":4,"category":"monopoly","image":"Stallmart.jpg","info":"Hello ENTERPRENUERS!! Ever thought of some innovation? Do u got the urge to make money through your ideas. Then this the best chance you have got! Grab it and earn it. If you ever thought of a start up, then have a demo experience of market from here. Stall mart brings you ‘stall your ideas’. Come up with an innovative business, implement the strategies and reap the benefits. Experience the thrill, stress and excitement of owning a business. Use your ethical ways to earn maximum profits and you may win. It is the time to innovate and implement. It’s an “ALL YOU EARN” event. Show the real entrepreneur inside you.","__v":0},{"problemStatements":[],"_id":"5b92c6c755218e15dff4aace","name":"navachar","displayName":"Navachar","size":3,"category":"monopoly","image":"Navachar.jpg","info":"Having an innovative business idea is great but put it to test is the real deal. Come up with your best business ideas and present it like a real manager, convince the audience and grab your deal. Navachar brings you the best platform to present your business idea out in the world and test its feasibility, functionality, and relevance in the real business atmosphere.","__v":0}]}