{"success":true,"subEvents":[{"problemStatements":["https://drive.google.com/uc?export=download&id=1SY7XgCRYSrIDjY4kGOVs3WFVfmOhe7yj"],"_id":"5b92c6c755218e15dff4aacf","name":"ziggurare","displayName":"Ziggurare","size":4,"category":"nirmaan","image":"ZIGGURARE.jpg","info":"Being updated with software skills is very essential professional requirement for a civil engineer. It is just another feather in your cap and gives you an edge over your fellow competitors. In this event imagination capabilities and designing skills of the participants will be tested.Be a part of future development that is awaiting the field of civil engineering in the design area. So come in large numbers and bring out the designer in you.","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1JBZbvH7O9qAcTrlWiSCl21wkmZFd1OXj"],"_id":"5b92c6c755218e15dff4aad0","name":"shutterup","displayName":"Shutter Up","size":1,"category":"nirmaan","image":"SHUTTERUP.jpg","info":"Do  you  love  to  capture  the  interesting  and  beautiful  scenes  around  you?  Do  you  stay  up  at nights  worrying  about  “composition”?  If  yes,  then  look  no  further.   The  NIRMAAN's  Online  Photography  Contest  'SHUTTER UP'  beckons  you!   Take  out  your  cameras  and  smartphones  and  click  away!  There is something more for you all. “You  don’t  take  a  photograph,  you  make  it.”  ―  Ansel  A","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1_8m9EKTYlp5aqfM1PlHMmMBdmthAF_bi"],"_id":"5b92c6c755218e15dff4aad1","name":"linkidge","displayName":"Linkidge","size":6,"category":"nirmaan","image":"LINKIDGE.jpg","info":"They say architecture is music in space, frozen at the spot, an art that calls for intricate design and imagery. Sometimes the best ideas are born out of the simplest of things. So we present to you the very dais to bring out yours.Unlimited ice cream sticks. Five creative minds. One structure. Strive for perfection in everything you do. Take the best that exists and make it better. When it does not exist, design it.—Sir Henry Royce, English engineer One of the biggest engineering problems is to connect people, to overcome physical obstructions and topographical boundaries for proper development of our society. Bridges provide the structural solution to all these problems, guaranteeing safest and easiest link between two parts through most adverse conditions like rivers, canopies, oceans, trenches and much more. Bridges are essential to our nation's infrastructural development Here at LINKIDGE event of Avishkar we provide you a platform to showcase your innovation, creativity, knowledge, and ability to tackle practical problems related to connecting to places with a model bridge.","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1Bwyc1kCvA16BQwgH3cKc2vAZM2h7rCz5"],"_id":"5b92c6c755218e15dff4aad2","name":"concube","displayName":"Concube","size":5,"category":"nirmaan","image":"CONCUBE.jpg","info":"Civil Engineering is incomplete without knowledge of concrete. All constructions, whether a minor or a major one, require use of concrete. So, here we arrive with Concube 2018 ,the best opportunity to test your knowledge and understanding about concrete and to use theoretical concepts to solve actual field problem. So make a team, cast your concrete cubes and get them tested as per standard criterias. Prove your worth by solving compulsive industrial problems using your skilled knowledge in simulation and modelling.","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1f3tct4NzGKBt-foeOCEFgEudMUOVO_5V"],"_id":"5b92c6c755218e15dff4aad3","name":"terraquiz","displayName":"Terraquiz","size":3,"category":"nirmaan","image":"TERRAQUIZ.jpeg","info":"Having an extra knowledge is never bad. Be the jack of all trades and figure out your knowledge and luck in the tri-round event 'terraquiz' . Find your mates and check your aptitude potential, answer general knowledge questions, solve trivias and puzzles with a pinch of civil engineering experience.","__v":0},{"problemStatements":["https://drive.google.com/uc?export=download&id=1SQGSU65xfW2W96vUMmjOfxEfCYdRKxkf"],"_id":"5b92c6c755218e15dff4aad4","name":"cognizance","displayName":"Cognizance","size":1,"category":"nirmaan","image":"COGNIZANCE.jpg","info":"'Change is the very law of nature . ' Abiding by this statement and keeping pace with the modern day requires technical and soft skills in abundance . So buckle up to test and improve the same and discover hidden aspects of your personality via Cognizance 2k18 . The event involves technical , aptitude , GD and PI rounds resembling both campus placements and the selection process in gate/ese.","__v":0}]}